package com.mycompany.mavenproject1;

import javafx.application.Application;
import javafx.geometry.Insets;
import javafx.scene.Scene;
import javafx.scene.control.Alert;
import javafx.scene.control.Button;
import javafx.scene.control.DatePicker;
import javafx.scene.layout.VBox;
import javafx.stage.Stage;
import java.time.LocalDate;
import javafx.scene.control.Menu;
import javafx.scene.control.MenuBar;
import javafx.scene.control.MenuItem;
import javafx.scene.layout.BorderPane;

/**
 * JavaFX App
 */
public class App extends Application {

    @Override
    public void start(Stage primaryStage) {
        DatePicker birthDatePicker = new DatePicker();
        birthDatePicker.setPromptText("Оберіть дату народження");

        Button showZodiacSignButton = new Button("Показати Знак Зодіаку");
        showZodiacSignButton.setOnAction(event -> {
            LocalDate birthDate = birthDatePicker.getValue();
            if (birthDate != null) {
                String[] zodiacInfo = getZodiacSign(birthDate.getMonthValue(), birthDate.getDayOfMonth());
                showAlert("Знак Зодіаку", zodiacInfo[0] + '\n' + zodiacInfo[1]);
            } else {
                showAlert("Помилка", "Будь ласка, виберіть дату народження.");
            }
        });

        MenuBar menuBar = createMenuBar();

        VBox vbox = new VBox(menuBar);
        BorderPane.setAlignment(vbox, javafx.geometry.Pos.TOP_LEFT);

        VBox root = new VBox(vbox, birthDatePicker, showZodiacSignButton);
        root.setPadding(new Insets(20));

        Scene scene = new Scene(root, 300, 200);
        primaryStage.setScene(scene);
        primaryStage.setTitle("Знак Зодіаку");
        primaryStage.show();
    }

    private MenuBar createMenuBar() {
        MenuBar menuBar = new MenuBar();

        Menu helpMenu = new Menu("Довідка");

        MenuItem aboutMenuItem = new MenuItem("Про програму");
        aboutMenuItem.setOnAction(event -> showAboutDialog());

        MenuItem authorMenuItem = new MenuItem("Про автора");
        authorMenuItem.setOnAction(event -> showAuthorInfo());

        helpMenu.getItems().addAll(aboutMenuItem, authorMenuItem);

        menuBar.getMenus().add(helpMenu);

        return menuBar;
    }

    private void showAboutDialog() {
        Alert alert = new Alert(Alert.AlertType.INFORMATION);
        alert.setTitle("Про програму");
        alert.setHeaderText(null);
        alert.setContentText("Ця програма призначена для визначення знаку Зодіаку за датою народження.");

        // Встановлення розміру вікна
        alert.getDialogPane().setPrefSize(400, 200);

        alert.showAndWait();
    }

    private void showAuthorInfo() {
        Alert alert = new Alert(Alert.AlertType.INFORMATION);
        alert.setTitle("Про автора");
        alert.setHeaderText(null);
        alert.setContentText("Автор: Палчей Максим"+'\n'+"Група:КН-ІНФ");

        // Встановлення розміру вікна
        alert.getDialogPane().setPrefSize(400, 200);

        alert.showAndWait();
    }

    private String[] getZodiacSign(int month, int day) {
        String[] zodiacSigns = {
            "Козоріг", "Водолій", "Риби", "Овен",
            "Телець", "Близнюки", "Рак", "Лев",
            "Діва", "Терези", "Скорпіон", "Стрілець"
        };
        String[] ZodiacInfo = new String[2];
        if (month > 11) {
            if (day >= 23) {
                ZodiacInfo[0] = zodiacSigns[0];
                ZodiacInfo[1] = "Головна якість Козорогів — стриманість: про них зазвичай говорять, що вони \"застебнуті на всі гудзики\". Це не означає, що у представників знака немає емоцій, просто вони ховають їх глибоко всередині, де вони вирують з величезною силою, яку не видно оточенню — вони вважають Козорогів сухарями";
            } else {
                ZodiacInfo[0] = zodiacSigns[11];
                ZodiacInfo[1] = "Стрілець — один із найактивніших і найенергійніших знаків зодіаку, яким під силу все, крім одного: вони категорично не можуть сидіти на місці. Їх тягнуть нові відчуття і враження, тому серед представників знака дуже багато мандрівників.";
            }
        } else if (month == 1) {
            if (day > 20) {
                ZodiacInfo[0] = zodiacSigns[1];
                ZodiacInfo[1] = "Водолії — не найпростіший, через свою неоднозначність і суперечливість, знак зодіаку. Його представники вважають своє життя прісним, тому постійно перебувають в пошуку нових вражень і відчуттів. Не дивно, що, відшукавши їх, вони часто потрапляють в безглузді, а часом і вельми неприємні ситуації";
            } else {
                ZodiacInfo[0] = zodiacSigns[0];
                ZodiacInfo[1] = "Головна якість Козорогів — стриманість: про них зазвичай говорять, що вони \"застебнуті на всі гудзики\". Це не означає, що у представників знака немає емоцій, просто вони ховають їх глибоко всередині, де вони вирують з величезною силою, яку не видно оточенню — вони вважають Козорогів сухарями";
            }
        } else if (month == 2) {
            if (day > 20) {
                ZodiacInfo[0] = zodiacSigns[2];
                ZodiacInfo[1] = "Риби — також дуже чутливий знак: вони вміють зчитувати інформацію буквально з повітря, тому про них говорять, як про людей з потужною інтуїцією. Представники знака настільки добре відчувають інших людей, що часом здається, що вони бачать оточення наскрізь і вміють читати думки.";
            } else {
                ZodiacInfo[0] = zodiacSigns[1];
                ZodiacInfo[1] = "Водолії — не найпростіший, через свою неоднозначність і суперечливість, знак зодіаку. Його представники вважають своє життя прісним, тому постійно перебувають в пошуку нових вражень і відчуттів. Не дивно, що, відшукавши їх, вони часто потрапляють в безглузді, а часом і вельми неприємні ситуації";
            }
        } else if (month == 3) {
            if (day > 20) {
                ZodiacInfo[0] = zodiacSigns[3];
                ZodiacInfo[1] = "За натурою вони – справжні лідери, бунтарі і одночасно ідеалісти, які вірять у світле майбутнє і вічне кохання. Вони вміють ставити перед собою мету і знають, як її досягти: найчастіше, вони беруть своє напиранням, але за необхідності можуть піти і обхідними шляхами.";
            } else {
                ZodiacInfo[0] = zodiacSigns[2];
                ZodiacInfo[1] = "Риби — також дуже чутливий знак: вони вміють зчитувати інформацію буквально з повітря, тому про них говорять, як про людей з потужною інтуїцією. Представники знака настільки добре відчувають інших людей, що часом здається, що вони бачать оточення наскрізь і вміють читати думки.";
            }
        } else if (month == 4) {
            if (day > 20) {
                ZodiacInfo[0] = zodiacSigns[4];
                ZodiacInfo[1] = "Найбільше представники цього знака люблять і цінують земні задоволення: смачну їжу, хороше вино, гарний одяг, побутові зручності і комфорт. Тельці консервативні – вони негативно ставляться до змін, не прагнуть до них самі і не вітають вчинки інших, коли ті затівають якісь пертурбації – як в особистому, так і суспільному житті.";
            } else {
                ZodiacInfo[0] = zodiacSigns[3];
                ZodiacInfo[1] = "За натурою вони – справжні лідери, бунтарі і одночасно ідеалісти, які вірять у світле майбутнє і вічне кохання. Вони вміють ставити перед собою мету і знають, як її досягти: найчастіше, вони беруть своє напиранням, але за необхідності можуть піти і обхідними шляхами.";
            }
        } else if (month == 5) {
            if (day > 21) {
                ZodiacInfo[0] = zodiacSigns[5];
                ZodiacInfo[1] = "Близнята – дуже яскравий знак, під яким народжуються неабиякі інтелектуальні особистості: письменники, поети, журналісти, юристи, громадські діячі. Їм властивий всебічний погляд на будь-який предмет, вони просто не вміють дивитися на світ однобоко – їм обов'язково потрібно врахувати безліч різних чинників, щоб володіти повнотою картини.";
            } else {
                ZodiacInfo[0] = zodiacSigns[4];
                ZodiacInfo[1] = "Найбільше представники цього знака люблять і цінують земні задоволення: смачну їжу, хороше вино, гарний одяг, побутові зручності і комфорт. Тельці консервативні – вони негативно ставляться до змін, не прагнуть до них самі і не вітають вчинки інших, коли ті затівають якісь пертурбації – як в особистому, так і суспільному житті.";
            }
        } else if (month == 6) {
            if (day > 21) {
                ZodiacInfo[0] = zodiacSigns[6];
                ZodiacInfo[1] = "Його представники справляють враження людей холодних, стриманих і відсторонених, їх ніби огортає ореол таємничості, але за цією \"бронею\" часто ховається тонка душевна організація, чутливість і вразливість. Вони дуже важко і глибоко переживають будь-які душевні потрясіння – особливо любовні драми, зради і втрати.";
            } else {
                ZodiacInfo[0] = zodiacSigns[5];
                ZodiacInfo[1] = "Близнята – дуже яскравий знак, під яким народжуються неабиякі інтелектуальні особистості: письменники, поети, журналісти, юристи, громадські діячі. Їм властивий всебічний погляд на будь-який предмет, вони просто не вміють дивитися на світ однобоко – їм обов'язково потрібно врахувати безліч різних чинників, щоб володіти повнотою картини.";
            }
        } else if (month == 7) {
            if (day > 22) {
                ZodiacInfo[0] = zodiacSigns[7];
                ZodiacInfo[1] = "Леви – товариські, добрі і щедрі: дізнавшись, що хтось потребує допомоги, вони з радістю її нададуть, але водночас пишатимуться собою і обов'язково скористаються можливістю похизуватися власним благородством і піднести свій вчинок з вигідного боку. Але Леви, і це позитивна їх якість, не люблять і не вміють брехати, а зачинати інтриги, пліткувати і лихословити – взагалі не їхній стиль поведінки.";
            } else {
                ZodiacInfo[0] = zodiacSigns[6];
                ZodiacInfo[1] = "Його представники справляють враження людей холодних, стриманих і відсторонених, їх ніби огортає ореол таємничості, але за цією \"бронею\" часто ховається тонка душевна організація, чутливість і вразливість. Вони дуже важко і глибоко переживають будь-які душевні потрясіння – особливо любовні драми, зради і втрати.";
            }
        } else if (month == 8) {
            if (day > 23) {
                ZodiacInfo[0] = zodiacSigns[8];
                ZodiacInfo[1] = "Дів, на відміну від інших знаків, не дратує рутинна і монотонна робота, вони, подібно до працьовитої Попелюшки, годинами можуть перебирати квасолю, відокремлюючи червону від білої. Представники знака мають аналітичний розум: ухвалюючи важливе рішення, вони легко прораховують всі \"за\" і \"проти\" і вкрай рідко помиляються.";
            } else {
                ZodiacInfo[0] = zodiacSigns[7];
                ZodiacInfo[1] = "Леви – товариські, добрі і щедрі: дізнавшись, що хтось потребує допомоги, вони з радістю її нададуть, але водночас пишатимуться собою і обов'язково скористаються можливістю похизуватися власним благородством і піднести свій вчинок з вигідного боку. Але Леви, і це позитивна їх якість, не люблять і не вміють брехати, а зачинати інтриги, пліткувати і лихословити – взагалі не їхній стиль поведінки.";
            }
        } else if (month == 9) {
            if (day > 23) {
                ZodiacInfo[0] = zodiacSigns[9];
                ZodiacInfo[1] = "Люди, що народилися під ним, як і їхнє позначення — Терези з двома чашами, завжди і у всьому прагнуть до гармонії і рівноваги. Правда, для цього їм доводиться довго вагатися — сумніви переважують то в один, то в інший бік, але результат, який дає представникам знака спокій і стабільність, того вартий. Іноді ця якість з позитивниї перетворюється на негативну — схильність до коливань і метань робить їх ненадійними партнерами як у діловому, так і в особистому житті. ";
            } else {
                ZodiacInfo[0] = zodiacSigns[8];
                ZodiacInfo[1] = "Дів, на відміну від інших знаків, не дратує рутинна і монотонна робота, вони, подібно до працьовитої Попелюшки, годинами можуть перебирати квасолю, відокремлюючи червону від білої. Представники знака мають аналітичний розум: ухвалюючи важливе рішення, вони легко прораховують всі \"за\" і \"проти\" і вкрай рідко помиляються.";
            }
        } else if (month == 10) {
            if (day > 22) {
                ZodiacInfo[0] = zodiacSigns[10];
                ZodiacInfo[1] = "Скорпіони мають потужну харизму, що робить їх прекрасними лідерами і керівниками: вони можуть взяти в роботу будь-яку — найскладнішу і важкореалізовану — ідею, і не тільки зацікавитися нею самі, але і захопити інших — співробітників і колег. Правда, самі вони після цього можуть швидко охолонути до справи, якою займаються, і переключитися на інше — мінливість теж у них в крові.";
            } else {
                ZodiacInfo[0] = zodiacSigns[9];
                ZodiacInfo[1] = "Люди, що народилися під ним, як і їхнє позначення — Терези з двома чашами, завжди і у всьому прагнуть до гармонії і рівноваги. Правда, для цього їм доводиться довго вагатися — сумніви переважують то в один, то в інший бік, але результат, який дає представникам знака спокій і стабільність, того вартий. Іноді ця якість з позитивниї перетворюється на негативну — схильність до коливань і метань робить їх ненадійними партнерами як у діловому, так і в особистому житті.";
            }
        } else if (month == 11) {
            if (day > 22) {
                ZodiacInfo[0] = zodiacSigns[11];
                ZodiacInfo[1] = "Стрілець — один із найактивніших і найенергійніших знаків зодіаку, яким під силу все, крім одного: вони категорично не можуть сидіти на місці. Їх тягнуть нові відчуття і враження, тому серед представників знака дуже багато мандрівників.";
            } else {
                ZodiacInfo[0] = zodiacSigns[10];
                ZodiacInfo[1] = "Скорпіони мають потужну харизму, що робить їх прекрасними лідерами і керівниками: вони можуть взяти в роботу будь-яку — найскладнішу і важкореалізовану — ідею, і не тільки зацікавитися нею самі, але і захопити інших — співробітників і колег. Правда, самі вони після цього можуть швидко охолонути до справи, якою займаються, і переключитися на інше — мінливість теж у них в крові.";
            }
        } else if (month == 12) {
            if (day > 22) {
                ZodiacInfo[0] = zodiacSigns[0];
                ZodiacInfo[1] = "Головна якість Козорогів — стриманість: про них зазвичай говорять, що вони \"застебнуті на всі гудзики\". Це не означає, що у представників знака немає емоцій, просто вони ховають їх глибоко всередині, де вони вирують з величезною силою, яку не видно оточенню — вони вважають Козорогів сухарями";
            } else {
                ZodiacInfo[0] = zodiacSigns[11];
                ZodiacInfo[1] = "Стрілець — один із найактивніших і найенергійніших знаків зодіаку, яким під силу все, крім одного: вони категорично не можуть сидіти на місці. Їх тягнуть нові відчуття і враження, тому серед представників знака дуже багато мандрівників.";
            }
        }
        return ZodiacInfo;
    }

    private void showAlert(String title, String message) {
        Alert alert = new Alert(Alert.AlertType.INFORMATION);
        alert.setTitle(title);
        alert.setHeaderText(null);
        alert.getDialogPane().setPrefSize(400, 200);
        alert.setContentText(message);
        alert.showAndWait();
    }

    public static void main(String[] args) {
        launch(args);
    }
}
